Autodesk.Revit.DB.SpatialElementCalculationLocation.MarkerPosition
The position of the spatial element calculation location marker.
Since:
2014

Autodesk.Revit.DB.SpatialElementCalculationLocation
The Spatial Element Calculation Location is used to specify the room/space where an
element should be considered as placed.
Remarks:
It currently has two types of calculation location:
SpatialElementCalculationPoint and SpatialElementFromToCalculationPoints
A user can turn on the Spatial Element Calculation Location in the family editor
by setting the family's ROOM_CALCULATION_POINT parameter.
A user can move the location of the Spatial Element Calculation Location in the family editor.
A user can visually verify the location of the Spatial Element Calculation Point by
selecting the fixture in the project.
Since:
2014